Revit 2026 API

# ExporterIFCUtilsEndExportInternal Method

---

Use the internal Revit implementation to relate elements at the end of export.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void EndExportInternal(
	ExporterIFC exporterIFC
)
```
```vb
Public Shared Sub EndExportInternal (
	exporterIFC As ExporterIFC
)
```
```cpp
public:
static void EndExportInternal(
	ExporterIFC^ exporterIFC
)
```
```fsharp
static member EndExportInternal :
        exporterIFC : ExporterIFC -> unit
```

#### Parameters

exporterIFC ExporterIFC
     The exporter.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace